In [1]:
#Exception handling continued : raise, finally

In [2]:
raise ValueError("Value is incorrect")

ValueError: Value is incorrect

In [5]:
server = int(input("Check the CPU Utilisation :"))
if(server > 70):
             raise TimeoutError("Waiting time is high")
else:
             print("Welcome to the site")

Check the CPU Utilisation :78

TimeoutError: Waiting time is high

In [8]:
import os
os.chdir('/Users/neil/Desktop')
try:
    f = open('customer1.csv')
    print(f.read())
    #perform file operations

except(FileNotFoundError):
    print("file is not present")
finally:
    f.close()

file is not present

In [9]:
#Pandas : It will help read any file and store them as dataframes. 
#dataframe : it's a collection of structured data. table/view

In [13]:
import pandas as pd

df = pd.read_csv("/Users/neil/Desktop/customer.csv")
df.head()    # df.tail()

    ID   Name  Year
8   18  Archi  2018
9   19  Archi  2018
10  20  Manik  2017
11  21  Archi  2018
12  22  Archi  2018

In [14]:
df[8:12]

    ID   Name  Year
8   18  Archi  2018
9   19  Archi  2018
10  20  Manik  2017
11  21  Archi  2018

In [16]:
df.shape

(13, 3)

In [17]:
df1 = pd.read_csv("https://raw.githubusercontent.com/NeilPandey/Test_Dataset/master/SUV_predict.csv")
df1.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [18]:
df1.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [19]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [20]:
df1.shape

(400, 5)

In [21]:
df_age_19 = df1[['User ID', 'Gender', 'Age']][df1['Age'] < 19]

In [23]:
df_age_19

      User ID  Gender  Age
14   15628972    Male   18
51   15764195  Female   18
76   15746737    Male   18
141  15666141  Female   18
165  15578738  Female   18

In [24]:
df_age_19.to_excel('/Users/neil/Desktop/SUV_19.xls')

In [26]:
df1.Age.max()

60

In [27]:
df1.Age.min()

18

In [29]:
df1.Age.mean()

37.655

In [30]:
df1.Age.median()

37.0

In [31]:
df1.EstimatedSalary.sum()

27897000

In [32]:
df1.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [35]:
bank_d = [(12431, 2130.00, 'SBI'),
       (13450, 1080.00, 'ICICI'),
       (18900, 500.00, 'SBI')]

bd = pd.DataFrame(bank_d, columns=['Txn_ID','Amt','Bank'])
bd

   Txn_ID     Amt   Bank
0   12431  2130.0    SBI
1   13450  1080.0  ICICI
2   18900   500.0    SBI

In [38]:
bank_d1 = pd.DataFrame(
          {"Txn_ID":[12432, 13451, 18901],
          "Amt":[2131.00, 1081.00, 501.00],
          "Bank":['HDFC','AXIS','BOI']})
bank_d1

   Txn_ID     Amt  Bank
0   12432  2131.0  HDFC
1   13451  1081.0  AXIS
2   18901   501.0   BOI

In [47]:
#if we're using concat, both filename should be similar.

con = pd.concat([bank_d1, bd], axis=0, ignore_index=True)
con

   Txn_ID     Amt   Bank
0   12432  2131.0   HDFC
1   13451  1081.0   AXIS
2   18901   501.0    BOI
3   12431  2130.0    SBI
4   13450  1080.0  ICICI
5   18900   500.0    SBI

In [48]:
gb = con.groupby('Bank')

In [50]:
gb.get_group('HDFC')

   Txn_ID     Amt  Bank
0   12432  2131.0  HDFC

In [51]:
for a, bank_n in gb:
    print(bank_n)

   Txn_ID     Amt  Bank
1   13451  1081.0  AXIS
   Txn_ID    Amt Bank
2   18901  501.0  BOI
   Txn_ID     Amt  Bank
0   12432  2131.0  HDFC
   Txn_ID     Amt   Bank
4   13450  1080.0  ICICI
   Txn_ID     Amt Bank
3   12431  2130.0  SBI
5   18900   500.0  SBI

In [52]:
#Joining : inner, left outer, right outer, full outer

In [55]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore", 'hyderabad'],
    "temperature": [32,45,30,40]})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [56]:
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore","Raipur"],
    "humidity": [68, 65, 75, 71]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75
3    Raipur        71

In [57]:
inner = pd.merge(temperature_df, humidity_df, on = 'city')
inner

       city  temperature  humidity
0    mumbai           32        65
1     delhi           45        68
2  banglore           30        75

In [58]:
left_out = pd.merge(temperature_df, humidity_df, on = 'city', how='left')
left_out

        city  temperature  humidity
0     mumbai           32      65.0
1      delhi           45      68.0
2   banglore           30      75.0
3  hyderabad           40       NaN

In [59]:
right_out = pd.merge(temperature_df, humidity_df, on = 'city', how='right')
right_out

       city  temperature  humidity
0     delhi         45.0        68
1    mumbai         32.0        65
2  banglore         30.0        75
3    Raipur          NaN        71

In [60]:
full = pd.merge(temperature_df, humidity_df, on = 'city', how='outer')
full

        city  temperature  humidity
0     mumbai         32.0      65.0
1      delhi         45.0      68.0
2   banglore         30.0      75.0
3  hyderabad         40.0       NaN
4     Raipur          NaN      71.0

In [61]:
full.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   city         5 non-null      object
 1   temperature  4 non-null      float64
 2   humidity     4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 160.0+ bytes

In [65]:
full = full.temperature.dropna()

In [66]:
full

0    32.0
1    45.0
2    30.0
3    40.0
Name: temperature, dtype: float64

In [67]:
#loc and iloc

#loc : index access
#iloc : value

#iloc reads value, exclude very first one. 
#loc reads index, inclusive of everything. 

df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45, 1, 2, 3, 4, 5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [68]:
df.loc[46:3]

    0
46  4
45  5
1   6
2   7
3   8

In [71]:
df.iloc[4:8]

    0
45  5
1   6
2   7
3   8